OpenFOAM/foam9tutorials/tutorials/incompressible/simpleFoam/windAroundBuildings/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin   -20; // L = 350
    xMax   330;
    yMin   -50; // L = 280
    yMax   230;
    zMin     0;
    zMax   140;
    xCells  25;
    yCells  20;
    zCells  10;
}

convertToMeters 1;

vertices
(
    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin)

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    frontAndBack
    {
        type symmetry;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
            (4 7 6 5)
        );
    }

);

// ************************************************************************* //
